spiricom/stm32f4/drumbox_405_firstIC/Src/waveplayer.c
/**
This is the Snyderphonics DrumBox synthesis code. 
**/

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "waveplayer.h"
#include "i2s.h"
#include "i2c.h"
#include "dma.h"
#include "codec.h"
#include "rng.h"
#include "stm32f4xx_hal_i2s_ex.h"
#include "math.h"
#include "spi.h"
#include "dma.h"

#include "main.h"
#include "wavetables.h"
#include "utilities.h"
#include "audiounits.h"
#include "waveplayer.h"




#define TEST_LED_ENABLED 0
#define USE_NEW_FEEDBACK 0

#define AUDIO_BUFFER_SIZE             64 //four is the lowest number that makes sense -- 2 samples for each computed sample (L/R), and then half buffer fills
#define HALF_BUFFER_SIZE      (AUDIO_BUFFER_SIZE/2)
#define NUM_SMOOTHED_PARAMS 3
#define NUM_KNOBS 6
#define NUM_ADC_VALUES 10
#define CAT_BUFFERSIZE 2
#define TIMEOUT 10
#define NUM_LEDS 8

#define USE_TOP_RIGHT_FOR_NOISE_DECAY 1

#define IC_BUFFER_SIZE 4
#define HALF_IC_BUFFER_SIZE (IC_BUFFER_SIZE / 2)
#define IC_TIMEOUT 200

#define DELAY_BUFFER_LENGTH 16384

#define NUM_FB_DELAY_TABLES 8

/* Ping-Pong buffer used for audio play */
int16_t audioOutBuffer[AUDIO_BUFFER_SIZE];
int16_t audioInBuffer[AUDIO_BUFFER_SIZE];

uint8_t whichKnob;

float smoothedParams[NUM_SMOOTHED_PARAMS];
float delayBuffer1[DELAY_BUFFER_LENGTH];

/* External variables --------------------------------------------------------*/
extern PCD_HandleTypeDef hpcd_USB_OTG_FS;
extern ADC_HandleTypeDef hadc3;
extern DMA_HandleTypeDef hdma_i2c1_rx;
extern I2C_HandleTypeDef hi2c1;
extern DMA_HandleTypeDef hdma_spi3_tx;
extern DMA_HandleTypeDef hdma_i2s3_ext_rx;
extern I2S_HandleTypeDef hi2s3;
extern RNG_HandleTypeDef hrng; // noise number generator
extern DMA_HandleTypeDef hdma_spi1_rx;
extern DMA_HandleTypeDef hdma_spi1_tx;
extern DMA_HandleTypeDef hdma_spi2_tx;
extern DMA_HandleTypeDef hdma_spi2_rx;
extern SPI_HandleTypeDef hspi1;
extern SPI_HandleTypeDef hspi2;

static HAL_DMA_StateTypeDef spi1tx;
static HAL_DMA_StateTypeDef spi1rx;

// IC communication variables
uint16_t i2cDataSize2 = 2;
uint8_t myTouchpad[2];
uint32_t I2Ctimeout2 = 2000;
uint8_t ic_counter = 0;
uint8_t IC_tx[IC_BUFFER_SIZE];
uint8_t IC_rx[IC_BUFFER_SIZE];
uint8_t ICbufferTx[IC_BUFFER_SIZE*10];
uint8_t ICbufferRx[IC_BUFFER_SIZE*10];
uint8_t I2CReset_buffer[1] = {0x06};
uint8_t I2C_init_command[3] = {0x58, 0x90, 0x00};
uint16_t ADC_values[NUM_ADC_VALUES];

// 0 = ADC, 1 = LED
uint8_t whichSPI2 = 0;

#define NUM_BYTES_TO_SEND 8
uint8_t externalDACOutputBuffer[NUM_BYTES_TO_SEND];
uint8_t externalDACOutputBufferTX[NUM_BYTES_TO_SEND];

// Sine 
tCycle sin1; 

// Noise 
tNoise noise1;

// Ramp
tRamp rampFeedback;
tRamp rampSineFreq;
tRamp rampDelayFreq;
tRamp rampKSGain; 
tRamp rampInputGain;

// Highpass
tHighpass highpass1;
tHighpass highpass2; 

// Envelope follower
tEnvelopeFollower envFollowNoise;
tEnvelopeFollower envFollowTrigOut;
tEnvelopeFollower envFollowSine;

// Envelope
tEnvelope envDive;

// Delay 
tDelay delay1;

// SVF
tSVF svf1; 

// Gain
float masterGain = 0.8f;
float sineGain = 0.7f;
float noiseGain = 2.0f; 
float noiseFilterGain = 0.5f;
float ksGain = 0.8f;

/****************808 Stuff***********************/
// SNARE1
// Tone 1
tTriangle snare_Tone1Osc; // Tri (not yet antialiased or wavetabled)
tSVF snare_Tone1Lowpass; // Lowpass from SVF filter
tEnvelope snare_Tone1EnvOsc;
tEnvelope snare_Tone1EnvGain;
tEnvelope snare_Tone1EnvFilter;
float snare_Tone1Gain = 0.35f;

// Tone 2
tTriangle snare_Tone2Osc; 
tSVF snare_Tone2Lowpass;
tEnvelope snare_Tone2EnvOsc;
tEnvelope snare_Tone2EnvGain;
tEnvelope snare_Tone2EnvFilter;
float snare_Tone2Gain = 0.35f;

// Noise 
tNoise snare_NoiseOsc; 
tSVF snare_NoiseLowpass;
tEnvelope snare_NoiseEnvGain;
tEnvelope snare_NoiseEnvFilter;
float snare_NoiseGain = 0.25f;

/************************************************/



float feedbacksamp = 0.f;

float newFreq = 0.0f;
float newDelay = 0.0f;
float newFeedback = 0.0f;


float m_input1 = 0.f;
float	m_output0 = 0.f;

#define FEEDBACK_LOOKUP_SIZE 5
#define DELAY_LOOKUP_SIZE 4
float FeedbackLookup[FEEDBACK_LOOKUP_SIZE] = { 0.0f, 0.8f, .999f, 1.0f, 1.001f };
//float DelayLookup[DELAY_LOOKUP_SIZE] = { 16000.f, 1850.f, 180.f, 40.f };
float DelayLookup[DELAY_LOOKUP_SIZE] = { 50.f, 180.f, 1400.f, 16300.f };

float feedbackDelayPeriod[NUM_FB_DELAY_TABLES];
const float *feedbackDelayTable[NUM_FB_DELAY_TABLES] = { FB1, FB2, FB3, FB4, FB5, FB6, FB7, FB8 };


uint8_t ADC_out[2];
uint8_t ADC_in[2];

uint8_t XYLED[2]; 

uint8_t ADC_Tx_Ready = 0;
uint8_t XY_Tx_Ready = 0;

#define DAC_OUT 1
#define TRIG_OUT_OLD 0
#define TRIG_OUT_NEW 0


uint16_t newcount = 0;
float sinefreq, delayfreq;
typedef enum BOOL {
	FALSE = 0,
	TRUE
} BOOL;

#define NUM_SAMPS_BETWEEN_TRIG_808 2000
#define NUM_SAMPS_BETWEEN_TRIG 8192
#define NUM_SAMPS_BETWEEN_VEL_CHANGE 3500
uint32_t sampSinceTrig = 0;
uint32_t sampSinceVelChange = 0;
uint16_t prevValue = 0;

uint8_t CAT_LED[CAT_BUFFERSIZE];
uint8_t JUNK_LED[CAT_BUFFERSIZE];

#define ADC_BUFFERSIZE 2
#define TIMEOUT 10



/* Private function prototypes -----------------------------------------------*/
// PROTOTYPES

// External Dac communication
void DMA1_externalDACInit(void);
void DMA1_externalDACSend(void);

// IC communication functions
void communicateWithOtherIC(void);
void start_Other_IC_Communication(void);
int16_t readAndWriteOtherChip(int16_t, uint16_t);
void WRITE_FLOAT_AS_BYTES(uint8_t byteNum, float data);
float READ_BYTES_AS_FLOAT(uint8_t byteNum);
void WRITE_FLOAT16_AS_BYTES(uint8_t byteNum, float data);
float READ_BYTES_AS_FLOAT16(uint8_t byteNum);
void WRITE_INT16_AS_BYTES(uint8_t byteNum, int16_t data);
int16_t READ_BYTES_AS_INT16(uint8_t byteNum);

// Audio functions
float ksTick(float);
void readExternalADC(void);
float audioProcess(float);
float audio808Process(float audioIn);
float interpolateFeedback(uint16_t idx);
float interpolateDelayControl(float raw_data);
void audioTick(uint16_t buffer_offset);
void setTrigOut(uint8_t set);
float clip(float min, float val, float max);
float randomNumber(void);

void setXYLED(uint8_t led1, uint8_t led2);
void Write7SegWave(uint8_t value);
void getXY_Touchpad(void);

/* Private functions ---------------------------------------------------------*/
void Error_Handler(void)
{
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, (GPIO_PinState) 0);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_1, (GPIO_PinState) 1);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, (GPIO_PinState) 0);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, (GPIO_PinState) 0);
  while(1)
  {
		;
  }
}

#define DO_SNARE 0

void audioInit(void)
{ 

	int16_t dummy1 = 0;
	uint16_t dummy2 = 0;
	DMA1_externalDACInit();
	// Initialize feedback lookup table data.
	float fbdp = 0.0002604165f; //min feedback delay period
	for (int i = 0; i < NUM_FB_DELAY_TABLES; i++) {
		feedbackDelayPeriod[i] = fbdp;
		fbdp *= 2.0f;
	}

	// Initialize audio units.
	// SNARE1
	#if DO_SNARE 
	tTriangleInit(&snare_Tone1Osc, SAMPLE_RATE);
	tSVFInit(&snare_Tone1Lowpass, SAMPLE_RATE, SVFTypeLowpass, 2000, 1.0f);
	tEnvelopeInit(&snare_Tone1EnvOsc, SAMPLE_RATE, 3.0f, 20.0f, 0, exp_decay, attack_decay_inc);
	tEnvelopeInit(&snare_Tone1EnvGain, SAMPLE_RATE, 10.0f, 200.0f, 0, exp_decay, attack_decay_inc);
	tEnvelopeInit(&snare_Tone1EnvFilter, SAMPLE_RATE, 3.0f, 200.0f, 0, exp_decay, attack_decay_inc);

	tTriangleInit(&snare_Tone2Osc, SAMPLE_RATE);
	tSVFInit(&snare_Tone2Lowpass, SAMPLE_RATE, SVFTypeLowpass, 2000, 1.0f);
	tEnvelopeInit(&snare_Tone2EnvOsc, SAMPLE_RATE, 3.0f, 25.0f, 0, exp_decay, attack_decay_inc);
	tEnvelopeInit(&snare_Tone2EnvGain, SAMPLE_RATE, 10.0f, 200.0f, 0, exp_decay, attack_decay_inc);
	tEnvelopeInit(&snare_Tone2EnvFilter, SAMPLE_RATE, 3.0f, 200.0f, 0, exp_decay, attack_decay_inc);

	tNoiseInit(&snare_NoiseOsc, SAMPLE_RATE, &randomNumber, NoiseTypeWhite);
	tSVFInit(&snare_NoiseLowpass, SAMPLE_RATE, SVFTypeLowpass, 2000, 3.0f);
	tEnvelopeInit(&snare_NoiseEnvGain, SAMPLE_RATE, 10.0f, 125.0f, 0, exp_decay, attack_decay_inc);
	tEnvelopeInit(&snare_NoiseEnvFilter, SAMPLE_RATE, 3.0f, 100.0f, 0, exp_decay, attack_decay_inc);

#endif
	tRampInit(&rampInputGain, SAMPLE_RATE, 5.0f, 1);
	tHighpassInit(&highpass1, SAMPLE_RATE, 20.0f);
	tEnvelopeFollowerInit(&envFollowTrigOut, 0.01f, 0.99f);

	tEnvelopeInit(&envDive, SAMPLE_RATE, 3.0f, 50.0f, 0, exp_decay, attack_decay_inc);

	tCycleInit(&sin1, SAMPLE_RATE, sinewave, SINE_TABLE_SIZE);
	tNoiseInit(&noise1, SAMPLE_RATE, &randomNumber, NoiseTypeWhite);
	tRampInit(&rampFeedback, SAMPLE_RATE, 10.0f, 1);
	tRampInit(&rampSineFreq, SAMPLE_RATE, 5.0f, 1);
	tRampInit(&rampDelayFreq, SAMPLE_RATE, 20.0f, 1);
	tRampInit(&rampKSGain, SAMPLE_RATE, 5.0f, 1);
	
