spiricom/stm32f4/drumbox_405_firstIC/Src/waveplayer.c
	tHighpassInit(&highpass2, SAMPLE_RATE, 45.0f);
	tEnvelopeFollowerInit(&envFollowNoise, 0.001f, 0.0f);
	tEnvelopeFollowerInit(&envFollowSine, 0.001f, 0.0f);
	
	tDelayInit(&delay1,delayBuffer1);
	tSVFInit(&svf1,SAMPLE_RATE,SVFTypeLowpass, 2000, 1.0f);
	
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET); 
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); // ADC CS pin goes high to make sure it's not selected
	HAL_Delay(100);
	

	//now to send all the necessary messages to the codec
	AudioCodec_init();
	HAL_Delay(100);
	//HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET); 
	
	
	//MX_SPI1_Init();
	//start_Other_IC_Communication();
	
	// set up the I2S driver to send audio data to the codec (and retrieve input as well)	
	HAL_I2SEx_TransmitReceive_DMA(&hi2s3, (uint16_t *)&audioOutBuffer[0], (uint16_t *)&audioInBuffer[0], AUDIO_BUFFER_SIZE);
  
	// SPI1 Other Chip communication Initial Call
	//HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_RESET); // Other IC CS pin goes high to allow conversion start
	//HAL_Delay(1); 
	//HAL_SPI_TransmitReceive_DMA(&hspi1, (uint8_t *)IC_tx, (uint8_t *)IC_rx, IC_BUFFER_SIZE); // removed (uint8_t *) casts before IC_tx and IC_rx
	
	whichSPI2 = 0;
	// SPI2 LED Initial Call
	
	setXYLED(3,3);
	
	
/*
  while(1)
	{
		//if(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_SET)
		//{
			//getXY_Touchpad();
			//Write7SegWave((myTouchpad[0] / 4));
		  spi1tx = HAL_DMA_GetState(&hdma_spi1_tx);
		  mess = spi1tx;
		  spi1rx = HAL_DMA_GetState(&hdma_spi1_rx);
		  mess = spi1rx;
		
		
		//}
	}
	*/
	/*
	while(1)
	{
		if(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_SET)
		{
			getXY_Touchpad();
			//Write7SegWave((myTouchpad[0] / 4));
			
		}
	}
	*/
	//HAL_SPI_TransmitReceive_DMA(&hspi1, (uint8_t *)IC_tx, (uint8_t *)IC_rx, IC_BUFFER_SIZE);
}

// Returns random floating point value [0.0,1.0)
float randomNumber(void) {
	
	uint32_t rand;
	HAL_RNG_GenerateRandomNumber(&hrng, &rand);
	float num = (((float)(rand >> 16))- 32768.f) * INV_TWO_TO_15;
	return num;
}



void setXYLED(uint8_t led1, uint8_t led2) {
	
	if (led1 < NUM_LEDS) {
		CAT_LED[0] = (1 << led1);
	} else {
		CAT_LED[0] = 0;
	}
	if (led2 < NUM_LEDS) {
		CAT_LED[1] = (1 << led2);
	} else {
		CAT_LED[1] = 0;
	}	
	//for (int i = 0; i < 10; i++);
	HAL_SPI_TransmitReceive_DMA(&hspi2, (uint8_t *)CAT_LED, (uint8_t *)JUNK_LED,  CAT_BUFFERSIZE);
	
}

void setTrigOut(uint8_t set) {
	if (set) {
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_10, GPIO_PIN_SET);
	} else {
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_10, GPIO_PIN_RESET);
	}
}

float FM_in; 
int count = 0;
void audioTick(uint16_t buffer_offset)
{
	uint16_t i = 0;
	int16_t current_sample = 0;  

	if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1)) {
		getXY_Touchpad();
	}
	
	newDelay = interpolateDelayControl((4096 - (myTouchpad[1] * 16)));
	rampDelayFreq.setDest(&rampDelayFreq,newDelay);
	
	newFreq = ((mtof1[myTouchpad[0] * 16]) * 0.2f);
	rampSineFreq.setDest(&rampSineFreq,newFreq);

	XYLED[0] = 7 - (uint8_t)(myTouchpad[0] * INV_TWO_TO_5);
	XYLED[1] = 7 - (uint8_t)(myTouchpad[1] * INV_TWO_TO_5);
	
	if (XY_Tx_Ready)
	{
		XY_Tx_Ready = 0;
		setXYLED(XYLED[0],XYLED[1]);
	}
	

	for (i = 0; i < (HALF_BUFFER_SIZE); i++)
	{
		if ((i & 1) == 0) {
			#if DO_SNARE
				current_sample = (int16_t)(audio808Process((float) (audioInBuffer[buffer_offset + i] * INV_TWO_TO_15)) * TWO_TO_15);
			#else 
			  current_sample = (int16_t)(audioProcess((float) (audioInBuffer[buffer_offset + i] * INV_TWO_TO_15)) * TWO_TO_15);
			#endif
			
		} else {
			FM_in = (float)(audioInBuffer[buffer_offset + i] * INV_TWO_TO_15);
		}
		audioOutBuffer[buffer_offset + i] = current_sample;
	}
	
	if (ADC_Tx_Ready) 
	{
		ADC_Tx_Ready = 0;
		readExternalADC();
	}
	
}

float f_abs(float in) {
	float out;
	if (in < 0.0f) {
		out = in * -1.0f;
	} else {
		out = in;
	}
	return out;
}

int trigState = 0;
float peakEnv808;
float vel = 0;
float vels[200]; 
int i = 0;
float audio808Process(float audioIn) {
	
	float sample;
	//gate the audio input with a ramped gain
	// alternative to custom f_abs is fabs in the math.h library?
	float absAudioIn = f_abs(audioIn);
	if (absAudioIn < 0.0001f) {
		rampInputGain.setDest(&rampInputGain, 0.0f);
	} 
	if (absAudioIn > 0.00015f) {
		rampInputGain.setDest(&rampInputGain, 1.0f);
	}
	float inputGain = rampInputGain.tick(&rampInputGain);
	audioIn = inputGain * audioIn;
	
	// TRIGGER STUFF
	float prevPeakEnv = peakEnv808;
	peakEnv808 = envFollowTrigOut.tick(&envFollowTrigOut,audioIn);

	if (!trigState) {
		
		if ((sampSinceTrig > NUM_SAMPS_BETWEEN_TRIG_808)  && (peakEnv808 > 0.09f)) {
			
			if (sampSinceVelChange > NUM_SAMPS_BETWEEN_VEL_CHANGE) {
				vel = clip(0.0,10.0f * (peakEnv808 - prevPeakEnv),1.0);
				if (i == 200) i = 0;
				vels[i] = vel;
				i++;
				sampSinceVelChange = 0;
				
			}
			//vel = 1.0f;
			
			trigState = 1;
			sampSinceTrig = 0;
			setTrigOut(1);

			snare_Tone1EnvOsc.on(&snare_Tone1EnvOsc, vel);
			snare_Tone1EnvGain.on(&snare_Tone1EnvGain, vel);
			snare_Tone1EnvFilter.on(&snare_Tone1EnvFilter, vel);
			
			snare_Tone2EnvOsc.on(&snare_Tone2EnvOsc, 1.0f);
			snare_Tone2EnvGain.on(&snare_Tone2EnvGain, vel);
			snare_Tone2EnvFilter.on(&snare_Tone2EnvFilter, 1.0f);
			
			snare_NoiseEnvGain.on(&snare_NoiseEnvGain, vel);
			snare_NoiseEnvFilter.on(&snare_NoiseEnvFilter, 1.0f);
			
		} 
	} else {
		
		if ((peakEnv808 < 0.07f)) {
		
			sampSinceTrig++;
			setTrigOut(0);
			trigState = 0;
		}
	}
		
	sampSinceTrig++;
	sampSinceVelChange++;

	snare_Tone1Osc.freq(&snare_Tone1Osc, (75.0f + (ADC_values[ControlParameterBR] * INV_TWO_TO_12) * 75.0f) + (20.0f*snare_Tone1EnvOsc.tick(&snare_Tone1EnvOsc)));
	float tone1 = snare_Tone1Osc.tick(&snare_Tone1Osc);
	snare_Tone1Lowpass.setFreq(&snare_Tone1Lowpass, 2000 + (500 * snare_Tone1EnvFilter.tick(&snare_Tone1EnvFilter)));
	snare_Tone1EnvGain.setDecay(&snare_Tone1EnvGain, 50.0f + (ADC_values[ControlParameterMR] * INV_TWO_TO_12) * 700.0f); 
	tone1 = snare_Tone1Lowpass.tick(&snare_Tone1Lowpass, tone1) * snare_Tone1EnvGain.tick(&snare_Tone1EnvGain);
	
	snare_Tone2Osc.freq(&snare_Tone2Osc, (150.0f + (ADC_values[ControlParameterBL] * INV_TWO_TO_12) * 150.0f) + (100.0f * snare_Tone2EnvOsc.tick(&snare_Tone2EnvOsc)));
	float tone2 = snare_Tone2Osc.tick(&snare_Tone2Osc);
	snare_Tone2Lowpass.setFreq(&snare_Tone2Lowpass, 2000 + (500 * snare_Tone2EnvFilter.tick(&snare_Tone2EnvFilter)));
	snare_Tone2EnvGain.setDecay(&snare_Tone2EnvGain, 30.0f + (ADC_values[ControlParameterMR] * INV_TWO_TO_12) * 500.0f); 
	tone2 = snare_Tone2Lowpass.tick(&snare_Tone2Lowpass, tone2) * snare_Tone2EnvGain.tick(&snare_Tone2EnvGain);
	
	float noise = snare_NoiseOsc.tick(&snare_NoiseOsc);
	snare_NoiseLowpass.setFreq(&snare_NoiseLowpass, 3500 +(500 * snare_NoiseEnvFilter.tick(&snare_NoiseEnvFilter)));
	snare_NoiseEnvGain.setDecay(&snare_NoiseEnvGain, 5.0f + (ADC_values[ControlParameterTL] * INV_TWO_TO_12) * 300.0f);
	noise = snare_NoiseLowpass.tick(&snare_NoiseLowpass, noise) * snare_NoiseEnvGain.tick(&snare_NoiseEnvGain);
	
	sample = tone1 * snare_Tone1Gain + tone2 * snare_Tone2Gain + noise * snare_NoiseGain;
	// use these for dive?
	//;
	//snare_Tone2EnvOsc.tick(&snare_Tone2EnvOsc);
	
	//clip(-1.0f, sample, 1.0f);
	//sample = FastTanh2Like1Term(sample);
	//clip(-1.0f, sample, 1.0f);
	//sample = shaper1[(uint16_t)((sample+1.0f)*0.5f * TWO_TO_16_MINUS_ONE)];
  sample = highpass1.tick(&highpass1, sample);
	
	return sample;
	
