spiricom/stm32f4/drumbox_405_firstIC/Src/waveplayer.c
}

float peakEnvDive;
float audioProcess(float audioIn) {
	
	float sample;
	//gate the audio input with a ramped gain
	// alternative to custom f_abs is fabs in the math.h library?
	float absAudioIn = f_abs(audioIn);
	if (absAudioIn < 0.0001f) {
		rampInputGain.setDest(&rampInputGain, 0.0f);
	} 
	if (absAudioIn > 0.00015f) {
		rampInputGain.setDest(&rampInputGain, 1.0f);
	}
	float inputGain = rampInputGain.tick(&rampInputGain);
	audioIn = inputGain * audioIn;
	
	// TRIGGER STUFF
	peakEnvDive = envFollowTrigOut.tick(&envFollowTrigOut,audioIn);

	if (!trigState) {
		
		if ((sampSinceTrig > NUM_SAMPS_BETWEEN_TRIG)  && (peakEnvDive > 0.08f)) {
		
			trigState = 1;
			sampSinceTrig = 0;
			setTrigOut(1);

			envDive.on(&envDive,1.0f);
		} 
	} else {
		
		if ((peakEnvDive < 0.07f)) {
		
			sampSinceTrig++;
			setTrigOut(0);
			trigState = 0;
		}
	}
		
	sampSinceTrig++;
	
	// UPDATE NOISE FILTER Q and FREQ
	float Q = 10.0f * (ADC_values[ControlParameterNoiseWidth] * INV_TWO_TO_12) + 0.05f;
	noiseFilterGain = 0.1f*(1.0f - (Q/10.0f))+0.025f;
	svf1.setQ(&svf1, Q);
	svf1.setFreq(&svf1, ADC_values[ControlParameterNoiseCutoff]); 
	
	// SET NOISE DECAY COEFF
#if USE_TOP_RIGHT_FOR_NOISE_DECAY
	envFollowNoise.decayCoeff(&envFollowNoise,adc1[ADC_values[ControlParameterNoiseDecay]]);
#else
	envFollowNoise.decayCoeff(&envFollowNoise,adc1[ADC_values[ControlParameterDive]]);
#endif
	
	// SET SINE DECAY COEFF
  envFollowSine.decayCoeff(&envFollowSine,adc1[ADC_values[ControlParameterSineDecay]]);

	// UPDATE FEEDBACK 
	newFeedback = interpolateFeedback(ADC_values[ControlParameterFeedback]);
	rampFeedback.setDest(&rampFeedback,newFeedback);
	smoothedParams[SmoothedParameterFeedback] = rampFeedback.tick(&rampFeedback);
	
	// UPDATE SINE FREQ
	sin1.freq(&sin1, rampSineFreq.tick(&rampSineFreq) + envDive.tick(&envDive) * ((ADC_values[ControlParameterBL] * INV_TWO_TO_12) * 100.0f) + (FM_in * 1000.0f));
	
	// UPDATE DELAY PERIOD
	smoothedParams[SmoothedParameterDelay] = rampDelayFreq.tick(&rampDelayFreq);
	//delayfreq = smoothedParams[SmoothedParameterDelay] + (1.0f/(((FM_in + 1.0f) * 0.5f) * 1000.0f)); //trying FM delay period -- need to work on this more, it's a number of samples in the array, this is period in seconds, I think
	delay1.setDelay(&delay1, smoothedParams[SmoothedParameterDelay]);
	
	// MIX
	float sineEnv,noiseEnv;
	sample = 0.8f * audioIn;
	if (ADC_values[ControlParameterFeedback] > 3) {
		sample += (ksGain * ksTick(audioIn));
	}
	if (ADC_values[ControlParameterSineDecay] > 3) {

		sineEnv = envFollowSine.tick(&envFollowSine,audioIn); 
		sample += (sineGain * sin1.tick(&sin1) * sineEnv);
		
	}
	sample *= .7f;
	
#if USE_TOP_RIGHT_FOR_NOISE_DECAY
	if (ADC_values[ControlParameterNoiseDecay] > 5) {

		noiseEnv = envFollowNoise.tick(&envFollowNoise,audioIn); 
		sample += noiseGain * (noiseFilterGain * svf1.tick(&svf1, noise1.tick(&noise1)) * envFollowNoise.tick(&envFollowNoise,audioIn));
	}
#else 
	if (ADC_values[ControlParameterDive] > 5) {

		noiseEnv = envFollowNoise.tick(&envFollowNoise,audioIn); 
		sample += noiseGain * (noiseFilterGain * svf1.tick(&svf1, noise1.tick(&noise1)) * envFollowNoise.tick(&envFollowNoise,audioIn));
	}
#endif
	
	sample *= masterGain;
	sample *= .5;
	//clip(-1.0f, sample, 1.0f);
	sample = FastTanh2Like1Term(sample);
	//clip(-1.0f, sample, 1.0f);
	//sample = shaper1[(uint16_t)((sample+1.0f)*0.5f * TWO_TO_16_MINUS_ONE)];
  sample = highpass1.tick(&highpass1, sample);

	if (++newcount == 16) {
		newcount = 0;
		
		uint16_t sineEnvToDAC = (uint16_t)(sineEnv * TWO_TO_12);
		externalDACOutputBuffer[0] = (sineEnvToDAC >> 8); 
		externalDACOutputBuffer[1] = (sineEnvToDAC & 255);
	
		uint16_t noiseEnvToDAC = (uint16_t)(noiseEnv * TWO_TO_12);
		externalDACOutputBuffer[2] = (noiseEnvToDAC >> 8); 
		externalDACOutputBuffer[3] = (noiseEnvToDAC & 255); 
	
		externalDACOutputBuffer[4] = ((myTouchpad[0] * 16) >> 8);
		externalDACOutputBuffer[5] = (myTouchpad[0] * 16) & 255;

		externalDACOutputBuffer[6] = ((myTouchpad[1] * 16) >> 8);
		externalDACOutputBuffer[7] = (myTouchpad[1] * 16) & 255;
	
		DMA1_externalDACSend();
	}

	// TRIGGER
#if TRIG_OUT_OLD
	float peakEnv = envFollowTrigOut.tick(&envFollowTrigOut,audioIn);
	if (sampSinceTrig > NUM_SAMPS_BETWEEN_TRIG) {
		
		if (peakEnv > 0.02f) {
			  setTrigOut(1);
				sampSinceTrig = 0;
		} 	
	} else {
		
		sampSinceTrig++;
	}
	
	if (peakEnv < 0.005f) { 
			setTrigOut(0);
	}
#endif
#if TRIG_OUT_NEW
	float peakEnv = envFollowTrigOut.tick(&envFollowTrigOut,audioIn);
	if (sampSinceTrig > NUM_SAMPS_BETWEEN_TRIG) {
		
		if ((peakEnv > 0.1f) && !trigState) {
			trigState = 1;
			setTrigOut(1);
			#if 0
				env808SnareAmplitude.on(&env808Snare, 1.0f);
			  env808SnareFilter.on(&env808Snare, 1.0f);
			#endif 
				sampSinceTrig = 0;
		} 
	} else if ((peakEnv < 0.08f) && trigState) {
		
		setTrigOut(0);
		trigState = 0;
		sampSinceTrig++;
	} else {
		
		sampSinceTrig++;
	}
#endif	
	
	//sample = 0.0f;
	return sample;
}

void DMA1_externalDACSend(void) {
	// Start communication with external DAC
	HAL_I2C_Master_Transmit_DMA(&hi2c1, 192, externalDACOutputBuffer, NUM_BYTES_TO_SEND);

}

void DMA1_externalDACInit(void) {
	// Start communication with external DAC
	//HAL_I2C_Master_Transmit_DMA(&hi2c1, 192, (uint8_t *)&externalDACOutputBufferTX[0], NUM_BYTES_TO_SEND);
	
	//Send a general call to the DAC chip (using i2c address 0 for "general call") that tells it to reset
	HAL_I2C_Master_Transmit_DMA(&hi2c1, 0, I2CReset_buffer, 1);
	HAL_Delay(10);
	//Send initial commands to the CV DAC channels to set their gain and vref stuff correctly
	HAL_I2C_Master_Transmit_DMA(&hi2c1, 192, I2C_init_command, 3);
	I2C_init_command[0] = 0x5A;
	HAL_I2C_Master_Transmit_DMA(&hi2c1, 192, I2C_init_command, 3);
	I2C_init_command[0] = 0x5C;
	HAL_I2C_Master_Transmit_DMA(&hi2c1, 192, I2C_init_command, 3);
	I2C_init_command[0] = 0x5E;
	HAL_I2C_Master_Transmit_DMA(&hi2c1, 192, I2C_init_command, 3);
}

float clip(float min, float val, float max) {
	
	if (val < min) {
		return min;
	} else if (val > max) {
		return max;
	} else {
		return val;
	}
}

float ksTick(float noise_in)
{
		float temp_sample, out, gain;
	  
		temp_sample = noise_in + (feedbacksamp * smoothedParams[SmoothedParameterFeedback]);
		
