spiricom/stm32f4/drumbox_405_firstIC/Src/waveplayer.c
		//feedbacksamp = delayTick(temp_sample);
		feedbacksamp = delay1.tick(&delay1, temp_sample);
				
	  //simple one-zero lowpass filter (moving average)
		m_output0 = 0.5f * m_input1 + 0.5f * feedbacksamp;
		m_input1 = feedbacksamp;
		feedbacksamp = clip(-1.0f,highpass2.tick(&highpass2,m_output0),1.0f);
		float absFeedbackSamp;
		if (feedbacksamp < 0.0f)
		{
			absFeedbackSamp = feedbacksamp * -1.0f;
		}
		else
		{
			absFeedbackSamp = feedbacksamp;
		}
		if (absFeedbackSamp < 0.001f) {
			rampKSGain.setDest(&rampKSGain, 0.0f);
		} 
		if (absFeedbackSamp > 0.0015f) {
			rampKSGain.setDest(&rampKSGain, 1.0f);
		}
		gain = rampKSGain.tick(&rampKSGain);
		out = gain * shaper1[(uint16_t)(((feedbacksamp + 1.0f) * 0.5f) * (TWO_TO_16_MINUS_ONE))];
		return out;
}


void readExternalADC(void)
{
	uint8_t knobnum;
	uint16_t knobval12bit;
	uint16_t knobsendbyte;
	uint8_t ADC_out[2];
	
	knobnum = ADC_in[0] >> 4;
	knobval12bit = (ADC_in[1] | ((ADC_in[0] & 15) << 8));
	ADC_values[knobnum] = knobval12bit;
	
	// write to ADC chip (asking for data on next channel)
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET); // ADC CS pin goes low to initiate conversion

	//create the word to send to the knob ADC chips (telling the ADC which channel to scan this time around)
	knobsendbyte = 6208 + (whichKnob << 7);
	ADC_out[0] = knobsendbyte >> 8;
	ADC_out[1] = knobsendbyte & 255;
	
	hspi1.State = HAL_SPI_STATE_READY;
	
	//for(int j = 0; j < 10; j++);
	
	HAL_SPI_TransmitReceive_DMA(&hspi2, (uint8_t *)ADC_out, (uint8_t *)ADC_in, ADC_BUFFERSIZE);
		
	//for(int j = 0; j < 5000; j++);

/*
	if (knobnum == ControlParameterFeedback){
		
		newFeedback = interpolateFeedback(ADC_values[ControlParameterFeedback]);
		rampFeedback.setDest(&rampFeedback,newFeedback);
	} 
*/
	if (++whichKnob >= NUM_KNOBS)
	{
		whichKnob = 0;
	}
}

float interpolateDelayControl(float raw_data)
{
	float scaled_raw = raw_data * INV_TWO_TO_12;
	if (scaled_raw < 0.4f)
	{
		return (DelayLookup[0] + ((DelayLookup[1] - DelayLookup[0]) * (scaled_raw * 2.5f)));
	}
	else if (scaled_raw < 0.8f)
	{
		return (DelayLookup[1] + ((DelayLookup[2] - DelayLookup[1]) * ((scaled_raw - 0.4f) * 2.5f)));
	}
	else
	{
		return (DelayLookup[2] + ((DelayLookup[3] - DelayLookup[2]) * ((scaled_raw - 0.8f) * 5.0f)));
	}	
}
float out;
uint16_t index1;
float delPer;
float w1,w2,range;
float interpolateFeedback(uint16_t idx) {
	
	index1 = idx;
	float delayPeriod = (smoothedParams[SmoothedParameterDelay] * INV_SAMPLE_RATE);
	delPer = delayPeriod;
	
	
	if (delayPeriod < feedbackDelayPeriod[0]) {
			out = FB1[idx];
	} else if (delayPeriod < feedbackDelayPeriod[1]) {
			// interp between fb[i] and fb[i-1]
			range = feedbackDelayPeriod[1] - feedbackDelayPeriod[0]; 
			w1 = (feedbackDelayPeriod[1] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB1[idx] * w1) + (FB2[idx] * w2); 	
	} else if (delayPeriod < feedbackDelayPeriod[2]) {
		
			range = feedbackDelayPeriod[2] - feedbackDelayPeriod[1]; 
			w1 = (feedbackDelayPeriod[2] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB2[idx] * w1) + (FB3[idx] * w2); 	
	} else if (delayPeriod < feedbackDelayPeriod[3]) {
		
			range = feedbackDelayPeriod[3] - feedbackDelayPeriod[2]; 
			w1 = (feedbackDelayPeriod[3] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB3[idx] * w1) + (FB4[idx] * w2);
	} else if (delayPeriod < feedbackDelayPeriod[4]) {
		
			range = feedbackDelayPeriod[4] - feedbackDelayPeriod[3]; 
			w1 = (feedbackDelayPeriod[4] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB4[idx] * w1) + (FB5[idx] * w2);
	} else if (delayPeriod < feedbackDelayPeriod[5]) {
		
			range = feedbackDelayPeriod[5] - feedbackDelayPeriod[4]; 
			w1 = (feedbackDelayPeriod[5] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB5[idx] * w1) + (FB6[idx] * w2);
	} else if (delayPeriod < feedbackDelayPeriod[6]) {
		
			range = feedbackDelayPeriod[6] - feedbackDelayPeriod[5]; 
			w1 = (feedbackDelayPeriod[6] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB6[idx] * w1) + (FB7[idx] * w2);
	} else if (delayPeriod < feedbackDelayPeriod[7]) {
		
			range = feedbackDelayPeriod[7] - feedbackDelayPeriod[6]; 
			w1 = (feedbackDelayPeriod[7] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB7[idx] * w1) + (FB8[idx] * w2);
	}else  {
			out = FB8[idx] ;
	} 
	
	return out;
	

/*
	float scaled_raw = idx * INV_TWO_TO_12;
	if (scaled_raw < 0.2f)
	{
		return (FeedbackLookup[0] + ((FeedbackLookup[1] - FeedbackLookup[0]) * ((scaled_raw) * 5.0f)));
	}		
	else if (scaled_raw < 0.6f)
	{
		return (FeedbackLookup[1] + ((FeedbackLookup[2] - FeedbackLookup[1]) * ((scaled_raw - 0.2f) * 2.5f)));
	}		
	if (scaled_raw < .95f)
	{
		return (FeedbackLookup[2] + ((FeedbackLookup[3] - FeedbackLookup[2]) * ((scaled_raw - 0.6f) * 2.857142857142f)));
	}
	else
	{
		return (FeedbackLookup[3] + ((FeedbackLookup[4] - FeedbackLookup[3]) * ((scaled_raw - 0.95f) * 20.0f )));
	}
*/

}

void Write7SegWave(uint8_t value)
{
	uint8_t Digits[2];
	Digits[0] = value % 10;
	Digits[1] = value / 10;
	
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_11, (GPIO_PinState)(Digits[0] & 1));
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_13, (GPIO_PinState)(Digits[0] & 2));
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_14, (GPIO_PinState)(Digits[0] & 4));
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_15, (GPIO_PinState)(Digits[0] & 8));
	
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, (GPIO_PinState)(Digits[1] & 1));
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_1, (GPIO_PinState)(Digits[1] & 2));
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, (GPIO_PinState)(Digits[1] & 4));
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, (GPIO_PinState)(Digits[1] & 8));
	
}

///BEGIN OTHER CHIP STUFF

// 
// make explicit send to IC inside readandwrite
// program other chip to recieve 4 8-bit bytes and send them right back


int16_t mycounter16Out = 0;
int16_t mycounter16In = 0;
int16_t prevcounterOut = 0;
uint8_t stopME = 0;


void pullUpOtherChipCS(void)
{
	static HAL_SPI_StateTypeDef spiState;
  spiState	= HAL_SPI_GetState(&hspi1);
	while(spiState != HAL_SPI_STATE_READY)
	{
		spiState	= HAL_SPI_GetState(&hspi1);
	}
	
