spiricom/stm32f4/drumbox_405_firstIC/Src/waveplayer.c
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_SET); // Other_IC_CS pin goes high to end conversion
}


int16_t readAndWriteOtherChip(int16_t Audio_In, uint16_t Buffer_Index)
{
	/*
	for (int i = 0; i < 4; i++)
	{
		IC_tx[i] = mycounter;
		mycounter++;
	}
*/
	if (stopME == 0) {
			WRITE_INT16_AS_BYTES(0,mycounter16Out);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_RESET); // Other_IC_CS pin goes low to start conversion
			//HAL_SPI_TransmitReceive_DMA(&hspi1, (uint8_t *)IC_tx, (uint8_t *)IC_rx, IC_BUFFER_SIZE);
			//mycounter16In = READ_BYTES_AS_INT16(2);
	}
	return 0;
	
	//mycounter16++;
	//WRITE_FLOAT16_AS_BYTES((2 * Buffer_Index), Audio_In);
	//WRITE_INT16_AS_BYTES((2 * Buffer_Index), mycounter16);
 //  mycounter16++;
	//if (mycounter16 > 1000)
	//{
	//	mycounter16 = 0;
	//}
	//return READ_BYTES_AS_FLOAT16(2 * Buffer_Index);
	//return READ_BYTES_AS_INT16(2 * Buffer_Index);
	
		//int offset = 4;
	//int numParams = 6;
	/*
	for (int i = 0; i < numParams; i++)
	{
		IC_tx[i * 2 + offset] = (ADC_values[i] >> 8);
		IC_tx[i * 2 + offset + 1] = (ADC_values[i] & 255);
	}
	

	if (main_counter == 0)
	{
		mycounter++;
	}
	for(int i = 0; i < IC_BUFFER_SIZE; i++)
	{
		IC_tx[i] = (mycounter + i);
	}
	//HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_RESET);

	
  //HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_SET);
	Write7SegWave(IC_rx[0]);

	main_counter++;
  return 0;
	*/
}



void writeOtherICBuffer(uint8_t whichByte, uint8_t data) 
{
	IC_tx[whichByte] = data; 
}

uint8_t readOtherICBuffer(uint8_t startingByte)
{
	return IC_rx[startingByte];
}

void WRITE_INT16_AS_BYTES(uint8_t byteNum, int16_t data) { 
	
      writeOtherICBuffer(byteNum, (data >> 8)); 
	    writeOtherICBuffer((byteNum + 1), (data & 255)); 
}

int16_t READ_BYTES_AS_INT16(uint8_t byteNum) { 

   int16_t data = ((readOtherICBuffer(byteNum) << 8) + (readOtherICBuffer(byteNum + 1) & 255));
   return(data); 
}

void WRITE_FLOAT16_AS_BYTES(uint8_t byteNum, float data) { 
   int i;

   for (i = 0; i < 2; i++) 
      writeOtherICBuffer(i + byteNum, *((uint8_t*)&data + i + 2) ) ; 
}

float READ_BYTES_AS_FLOAT16(uint8_t byteNum) { 
   int i; 
   float data;

   for (i = 2; i < 2; i++) 
      *((uint8_t*)&data + i + 2) = readOtherICBuffer(i + byteNum);

   return(data); 
}


////END OTHER CHIP STUFF

void HAL_I2S_TxCpltCallback(I2S_HandleTypeDef *hi2s)
{
	//pullUpOtherChipCS();
	audioTick(HALF_BUFFER_SIZE);
}

void HAL_I2S_TxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
	//pullUpOtherChipCS();
  audioTick(0);
}

void HAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s)
{
	;
}

void HAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
	;
}

void HAL_SPI_TxRxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
	
	//if it's SPI1, that's the other stm32f4 IC, ready for new data.
	/*
	if(hspi == &hspi1)
	{
		//HAL_SPI_TransmitReceive(&hspi1, (uint8_t *)IC_tx, (uint8_t *)IC_rx, IC_BUFFER_SIZE, IC_TIMEOUT);
		//nothing should be necessary, since the buffer should be circular
		//HAL_SPI_TransmitReceive_DMA(&hspi1, (uint8_t *)IC_tx, (uint8_t *)IC_rx, IC_BUFFER_SIZE);
		//HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_SET); // Other IC CS pin goes high to stop conversion
		//for (int i = 0; i < HALF_IC_BUFFER_SIZE; i++)
		//{
		//	IC_tx[i] = ICbufferTx[i];
		//}
	}
	*/
}
#if 0
void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi) {
	if (hspi == &hspi2) {
		
		if (!whichSPI2) {
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5, GPIO_PIN_SET); // CAT4016 Latch pin goes high to latch data
			ADC_Tx_Ready = 1;
			whichSPI2 = 1;
		} else {
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); // ADC CS pin goes high
			XY_Tx_Ready = 1;
			whichSPI2 = 0;
		}
		
		//readExternalADC();
	}
}
#endif


void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi)
{
	
	if(hspi == &hspi1) {
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_SET); // Other IC CS pin goes high to stop conversion
	} else if (hspi == &hspi2) { 
		if (!whichSPI2) {
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5, GPIO_PIN_SET); // CAT4016 Latch pin goes back low to reset it
			for (int i =0; i < 5; i++);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5, GPIO_PIN_RESET); // CAT4016 Latch pin goes high to latch data
			ADC_Tx_Ready = 1;
			whichSPI2 = 1;
		} else {
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); // ADC CS pin goes high
			XY_Tx_Ready = 1;
			whichSPI2 = 0;
		}
	} else {
			
	}
#if 0
	//if it's SPI1, that's the other stm32f4 IC, ready for new data.
	if(hspi == &hspi1)
	{
		//pullUpOtherChipCS();
		hspi1.State = HAL_SPI_STATE_READY;
			
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_SET); // Other IC CS pin goes high to stop conversion
		
		mycounter16In = READ_BYTES_AS_INT16(0); ///this is signed 16 int
		//Write7SegWave(mycounter16In);
		
		if (mycounter16In != prevcounterOut)
		{
			//stopME = 1;
		}
		prevcounterOut = mycounter16Out; 
		mycounter16Out++;
		
    //OtherICBufferIndexNum = 0;
	  //start_Other_IC_Communication();
		
		WRITE_INT16_AS_BYTES(0,mycounter16Out);
		
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_RESET); // Other_IC_CS pin goes low to start conversion
		
		HAL_SPI_TransmitReceive_DMA(&hspi1, (uint8_t *)IC_tx, (uint8_t *)IC_rx, IC_BUFFER_SIZE);
		
	
		//for (int i = 0; i < HALF_IC_BUFFER_SIZE; i++)
		//{
		//	IC_tx[i + HALF_IC_BUFFER_SIZE] = ICbufferTx[i + HALF_IC_BUFFER_SIZE];
		//}
	}

#endif
}

void communicateWithOtherIC(void) {
	//pullUpOtherChipCS();
		hspi1.State = HAL_SPI_STATE_READY;
			
		//HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_SET); // Other IC CS pin goes high to stop conversion
		
		mycounter16In = READ_BYTES_AS_INT16(0); ///this is signed 16 int
		//Write7SegWave(mycounter16In);
		
		if (mycounter16In != prevcounterOut)
		{
			//stopME = 1;
		}
		prevcounterOut = mycounter16Out; 
		mycounter16Out++;
		
    //OtherICBufferIndexNum = 0;
	  //start_Other_IC_Communication();
		
		WRITE_INT16_AS_BYTES(0,mycounter16Out);
		
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_RESET); // Other_IC_CS pin goes low to start conversion
		
		for (int i = 0; i < 10; i++) {
			
		}
		
		HAL_SPI_TransmitReceive_DMA(&hspi1, (uint8_t *)IC_tx, (uint8_t *)IC_rx, IC_BUFFER_SIZE);
}


void start_Other_IC_Communication(void)
{
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_RESET); // Other_IC_CS pin goes low to start conversion
	//HAL_Delay_us(1);
	for (int i = 0; i < 10; i++)
	{
	}
	HAL_SPI_TransmitReceive_DMA(&hspi1, (uint8_t *)IC_tx, (uint8_t *)IC_rx, IC_BUFFER_SIZE);
}

void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
	
	Write7SegWave(HAL_SPI_GetError(hspi));
}

void getXY_Touchpad(void) {
  // retreive values from the XY touchpad
	// I2C address = 9, 1000k, 
	HAL_I2C_Master_Receive_DMA(&hi2c1, 18, myTouchpad, i2cDataSize2);
}

 void HAL_I2C_MasterRxCpltCallback(I2C_HandleTypeDef *hi2c)
{
	//Write7SegWave((myTouchpad[0] / 4));
	//HAL_I2C_Master_Receive_DMA(&hi2c1, 18, myTouchpad, i2cDataSize2);
}

float FastTanh2Like4Term(float Input)
{
	float a, b;
	if (Input < 0.0f)
	{
		a = Input * -1.0f;
	}
	else
	{
		a = Input;
	}
	b = 12.0f + a * (6.0f + a * (3.0f + a));
	return (Input * b) / (a * b + 24.0f);

}

float FastTanh2Like1Term(float Input)
{
	float a;
	if (Input < 0.0f)
	{
		a = Input * -1.0f;
	}
	else
	{
		a = Input;
	}
	return (Input / (a + 3.0f));
}

